# 16 - Menata Ulang Data Frame dengan Multiple Indexes Menggunakan *Unstack()*

# Import Modules

Module yang digunakan :
1. pandas

In [7]:
import pandas as pd

- Mengecheck versi dari module yang digunakan yaitu pandas.

In [8]:
print(pd.__version__)

1.0.5

# Membuat Data Frame

1. Membuat data set titanicfull.csv menjadi format data frame dengan menggunakan method pd.read_csv.
2. Menampilkan 5 baris dari hasil data frame yang telah dibuat menggunakan method *df.head()*.

In [9]:
df = pd.read_csv('C:/Users/ASUS/Desktop/Belajar-Python-Pandas/titanicfull.csv')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S

# Data Frame dengan Multiple Indexes dari hasil groupping

- Melakukan pengelompokkan atau groupping data berdasarkan *sex* (female dan male) dan *pclass* (1, 2, dan 3).
- Mengamati data *survived* dan mengambil aggregate valuenya dengan *mean()*
- Pemanggilan to_frame() berfungsi agar tampilan menjadi lebih rapih.

In [11]:
df.groupby(['sex', 'pclass'])['survived'].mean().to_frame()

               survived
sex    pclass
female 1       0.965278
       2       0.886792
       3       0.490741
male   1       0.340782
       2       0.146199
       3       0.152130

- Menata Ulang Data Frame dengan Multiple Indexes

Untuk menata ulang data frame yang multiple indexes, kita dapat melakukan groupping berdasarkan *sex* dan *pclass* serta mengamati data *survived* dan mengambil aggregate valuenya dengan *mean()* seperti sebelumnya. Kemudian, kita dapat memanggil fungsi *unstack()*.

In [13]:
df.groupby(['sex', 'pclass'])['survived'].mean().unstack()

pclass         1         2         3
sex
female  0.965278  0.886792  0.490741
male    0.340782  0.146199  0.152130